# GetObjMaterialHandle

```pascal
FUNCTION GetObjMaterialHandle(h : HANDLE): HANDLE;
```

```python
def vs.GetObjMaterialHandle(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|object handle|

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes